#define _CRT_SECURE_NO_WARNINGS 
#include <stdio.h>
/*
// 버블 정렬
int main()
{
	int N, i, j, arr[1000], tmp;
	scanf("%d", &N);
	for (i = 0; i < N; i++)
		scanf("%d", &arr[i]);
	for (i = 0; i < N - 1; i++)
	{
		// N-1-i가 더 좋음 N-1도 가능은 함
		// j가 한 번 다 돌고 나면 가장 큰 수가 아래부터 쌓임
		// 그래서 뒤는 생각 안 해도 되니까 N-1-i임
		for (j = 0; j < N - 1 - i; j++)  
		{
			if (arr[j] > arr[j + 1])
			{
				tmp = arr[j];
				arr[j] = arr[j + 1];
				arr[j + 1] = tmp;
			}
		}
	}
	for (i = 0; i < N; i++)
		printf("%d\n", arr[i]);

	return 0;
}
*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
// 선택 정렬
int main()
{
	int N, i, j, arr[1000], tmp;
	scanf("%d", &N);
	for (i = 0; i < N; i++)
		scanf("%d", &arr[i]);
	for (i = 0; i < N - 1; i++)
	{
		int min = 1000, val;
//////////////////////////////////////////////////////
// 최소값 찾기
		for (j = i + 1; j < N; j++)
		{
			if (min > arr[j])
			{
				min = arr[j];
				val = j;
			}
		}
//////////////////////////////////////////////////////

//////////////////////////////////////////////////////
// arr[i]와 최소값 바꿔주기
		if (arr[i] > arr[val])
		{
			tmp = arr[i];
			arr[i] = arr[val];
			arr[val] = tmp;
		}
//////////////////////////////////////////////////////
	}
	for (i = 0; i < N; i++)
		printf("%d\n", arr[i]);

	return 0;
}
*/
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 삽입 정렬
int main()
{
	int N, i, j, arr[1000], tmp;
	scanf("%d", &N);
	for (i = 0; i < N; i++)
		scanf("%d", &arr[i]);
	for (i = 1; i < N; i++)
	{
//////////////////////////////////////////////////////
// 들어올리기
		tmp = arr[i];
//////////////////////////////////////////////////////
		for (j = i - 1; j >= 0; j--)
		{
//////////////////////////////////////////////////////
// 들어올린 수보다 크면 오른쪽으로 밀기
// 밀다가 작은 값 나오면 그 값 오른쪽에 들어올린 수를 두기
			if (tmp < arr[j])
			{
				arr[j + 1] = arr[j];
				arr[j] = tmp;
			}
			else
				break;
		}
//////////////////////////////////////////////////////
	}
	for (i = 0; i < N; i++)
		printf("%d\n", arr[i]);

	return 0;
}